---
kind: property
id: P:Autodesk.Revit.DB.TriangulatedSolidOrShell.ShellComponentCount
source: html/94ab2f15-4e78-fdc5-8f74-c1a932d7e9ed.htm
---
# Autodesk.Revit.DB.TriangulatedSolidOrShell.ShellComponentCount Property

The number of TriangulatedShellComponents that this TriangulatedSolidOrShell contains.

## Syntax (C#)
```csharp
public int ShellComponentCount { get; }
```